[{"overall": 4.0, "vote": "3", "verified": false, "reviewTime": "12 14, 2011", "reviewerID": "A19NP8YYADOOSF", "asin": "B003VNCROU", "reviewerName": "N. Krumpe", "reviewText": "Though not without its faults, this software is amazingly accurate.\n\nI haven't tried voice recognition software in a long time, mainly because it used to take a lot of \"training\" (reading hour-long passages of text while the software learns my speech patterns) to get it to an acceptable level of accuracy.  A lot has changed in the last several years: improvements in voice recognition algorithms, and more powerful home computers have led to software that is impressively accurate right out of the box.  In under five minutes of reading to my computer, I found that the software was giving me near-perfect accuracy.  As a test, I read Walt Whitman's poem, \"When I Heard the Learn'd Astronomer\".  I read at a very natural pace (perhaps even a bit rushed), including punctuation, and the software scored 100% for accuracy.\n\nBesides its accuracy, Dragon NaturallySpeaking impressed me with its fairly intuitive set of commands, both for editing documents and for \"getting around\" in Windows and on the web.  Though references are provided to let you know the commands that are available, I found it pretty easy to guess correctly at the commands I needed.  For example, I said, \"search the web for computer science\".  A browser window quickly opened, and took me to the Bing search page to show me the results for \"computer science\".  Preferring Google results, I decided to try \"Search Google for computer science\".  Sure enough, it worked to (as did searching Yahoo).  Then I tried \"search computer for jpegs\" and immediately was presented with a list of jpeg files on my computer.  When I'm not sure what to say, I just need to say \"What can I say\", and Dragon NaturallySpeaking will give me a list of commands.  (And, apparently, I can teach it new commands, but I haven't tried that yet.)  All in all, I found that I could guess the right commands about 75% of the time.\n\nA NOTE ABOUT MULTIPLE USERS: I found it interesting that the software recognized my own voice almost perfectly, but when I handed the microphone over to my 11-year-old son, the accuracy dropped to about zero percent.  Apparently, those five minutes I spent reading must have helped it \"lock in\" to my voice and speech patterns.  I wondered if it would be possible to set up a separate profile for my son.  As far as I can tell, however, the license for this software is bound to \"an individual\".  You, the user, can use the software (even on multiple machines, though not simultaneously).  However, multiple people cannot use the software on one machine unless each gets a license.  Please note that this is my understanding of the license agreement.  Don't trust my interpretation.  If you intend to allow multiple people to use the software, you may want to investigate the exact terms of the license.\n\nOne other issue: the installation process was a bit bumpy for me on my Windows 7 Professional 64-bit edition.  And, once installed, I had trouble downloading the free update from version 11 to version 11.5.  However, customer service was helpful in sending me steps to correct the issue.  Now that it's installed and updated, I find it to work very well, and is very unobtrusive.\n\nAll in all, I'm very happy with this latest version of Dragon NaturallySpeaking, and expect that it will get a lot of use!", "summary": "Accurate, intuitive", "unixReviewTime": 1323820800},
{"overall": 4.0, "vote": "4", "verified": false, "reviewTime": "12 10, 2011", "reviewerID": "AAEHOTZ1GRAUX", "asin": "B003VNCROU", "reviewerName": "Jim Bernheimer", "reviewText": "Dragon Naturally Speaking works well after you've \"trained\" it.  The more you use it, the less errors it will generate.  Is it perfect or live up to the accuracy level the developers say?  Not in my experience, but maybe I need to keep using it to get better performance.  Only time will tell.\n\nI used version 9 before and it was just \"okay.\"  The newer version performs better.\n\nMy laptop is an aging vista in need of a replacement and this software can be a bit of a resource hog on this platform.  Newer systems should not have much difficulty.  So far, it works well from microphone dictation.  I've also used a digital voice recorder with less than stellar results.  In fairness to the software, I'm using the recorder \"hands free\" while driving so the background noise is significantly higher.\n\nIn the end, Dragon's performance depends on the user.  Keep with it and you'll do well.  If you are impatient and expect instant gratification you my be dissappointed.", "summary": "Worth it as long as you put some effort into it.", "unixReviewTime": 1323475200},
{"overall": 4.0, "verified": false, "reviewTime": "10 26, 2011", "reviewerID": "A2F2S1L61X1LA9", "asin": "B003VNCROU", "reviewerName": "Bromptonboy", "reviewText": "This is an excellent and useful product.  I must admit, that I was very doubtful when I first gave this program a whirl, but I am a convert.  Setup is fairly straight forward, but requires a bit of time for each user to set it up properly.  The software must be trained properly to deal with each users voice.  This is done by a number of different exercises and readings that you will be stepped through.  This took me around 20 minutes or so to complete.  Afterwards, the program was able to take dictation from me with complete accuracy.  I have limited it's use to just word processing, and some emails - so I cannot say that I have completely put the program through its paces.  My intent is to set this up for an elderly relative suffering from arthritis who cannot type long email responses.  One annoyance with this program is the update function that runs in the background.  It doesn't properly ID itself, and I thought it was some sort of spyware when I first encountered the splash and notification.", "summary": "Very useful, and surprisingly accurate", "unixReviewTime": 1319587200},
{"overall": 2.0, "vote": "5", "verified": false, "reviewTime": "04 21, 2011", "reviewerID": "A36EW68H08UOCS", "asin": "B003VNCROU", "reviewerName": "Mark J. Fowler", "reviewText": "The ability to turn your spoken communication into text is an admirable goal.  Unfortunately Dragon Naturally Speaking Premium 11, even after a few hours of \"training\" (both of myself and the software) the effort required to produce a few lines of incorrectly transcribed English made this product seem much more like \"obstacle\" than \"aid\".\n\nYes, I tried the plug in headset that comes with the software.  Yes, I also tried the microphone that works perfectly for skyping and magic-jack phone calls. Yes, I spent two hours interfacing with the machine, reading prepared text back to the software and \"teaching\" it corrections to the mistakes it was making. No, I don't speak with a lisp or use English as a third language after being raised in China or Eastern Europe.\n\nThis product would only be recommended for those who are not fluent with a keyboard, or who wouldn't mind scads of errors in their text.\n\nI'm not giving up on the prospect that suitable software may exist in the future, compatible with common PC set-ups.  Truth in advertising: I received my copy gratis as an Amazon Vine Voice reviewer.  Obtained free, I still do not use this product.", "summary": "It shouldn't be this difficult", "unixReviewTime": 1303344000}
]